Problem 1: Combining Conditions

a) Find all rows where Gender is "Female" AND Marks >= 85.

b) Find all rows where City is not "New York" OR Marks < 80.

Problem 2: Filtering with Multiple Criteria

a) Display rows where Age > 20 AND Marks are between 80 and 90 (inclusive).

b) Filter rows where Gender is "Male", City is "Chicago", AND Marks > 70.

Problem 3: Applying Conditional Functions

Add a new column Performance:

"High" if Marks > 85 AND Age < 22.

"Medium" if Marks are between 75 and 85 (inclusive).

"Low" otherwise.

Problem 4: Multi-Condition Row Count

Count how many students have:

Marks > 80 AND belong to "Los Angeles" OR "Chicago".

In [1]:
import pandas as pd

In [2]:
d1={"Name":["John","Alice","Bob","Emma"],
"Age":[20,22,12,21],
"Gender":["Male","Female","Male","Female"],
"Marks":[88,92,75,89],
"City":["New York","Los Angeles","Chicago","San Fransico"]}
vr=pd.DataFrame(d1)

In [6]:
vr.loc[(vr["Gender"]=="Female")&(vr["Marks"]>=85)]

    Name  Age  Gender  Marks          City
1  Alice   22  Female     92   Los Angeles
3   Emma   21  Female     89  San Fransico

In [7]:
vr.loc[(vr["City"]=="New York")&(vr["Marks"]<80)]

Empty DataFrame
Columns: [Name, Age, Gender, Marks, City]
Index: []

In [10]:
vr.loc[(vr["Age"]>20)&(vr["Marks"]>80)&(vr["Marks"]<90)]

   Name  Age  Gender  Marks          City
3  Emma   21  Female     89  San Fransico

In [21]:
vr.loc[(vr["Gender"]=="Male")&(vr["City"]=="Chicago")&(vr["Marks"]>70)]

  Name  Age Gender  Marks     City
2  Bob   12   Male     75  Chicago

In [35]:
def perfomr(Marks,Age):
    if Marks >85 and Age< 22:
        return "High"
    elif Marks >75 :
        return "Medium"
    else:
        return"Low"
vr["Performance"]=vr.apply(lambda row: perfomr(row["Marks"],row["Age"]),axis=1)
vr

    Name  Age  Gender  Marks          City Performance
0   John   20    Male     88      New York        High
1  Alice   22  Female     92   Los Angeles      Medium
2    Bob   12    Male     75       Chicago         Low
3   Emma   21  Female     89  San Fransico        High

In [36]:
vr.loc[(vr["Marks"]>80)&((vr["City"]=="Los Angeles")|(vr["City"]=="Chicago"))].count()

Name           1
Age            1
Gender         1
Marks          1
City           1
Performance    1
dtype: int64

Name           1
Age            1
Gender         1
Marks          1
City           1
Performance    1
dtype: int64